some_text=('black_lives_metter')
print(some_text)
print(some_text [2:3]) #выведите третий символ этой строки.
print(some_text [-2]) # выведите предпоследний символ этой строки.
print(some_text [:5]) #выведите первые пять символов этой строки.
print(some_text [:-2]) #выведите всю строку, кроме последних двух символов.
print(some_text [::2]) #выведите все символы с четными индексами
print(some_text[1::2]) #выведите все символы с нечетными индексами, то есть начиная со второго символа строки
print(some_text [::-1]) #выведите все символы в обратном порядке.
print(some_text [::-2]) #выведите все символы строки через один в обратном порядке, начиная с последнего.
print(len(some_text)) #выведите длину данной строки
